Initial Exploration S&P 500

In [1]:
import pandas as pd
SP_500 = pd.read_csv('./Data_files/sap500.csv', encoding='cp1252') # Loading row data

In [2]:
SP_500.head()

         Date       Open       High        Low      Close  Volume
0  1927-12-30  17.660000  17.660000  17.660000  17.660000       0
1  1928-01-03  17.760000  17.760000  17.760000  17.760000       0
2  1928-01-04  17.719999  17.719999  17.719999  17.719999       0
3  1928-01-05  17.549999  17.549999  17.549999  17.549999       0
4  1928-01-06  17.660000  17.660000  17.660000  17.660000       0

In [3]:
SP_500.tail()

,Date,Open,High,Low,Close,Volume
24328,2024-11-05,5722.430176,5783.439941,5722.100098,5782.759766,3768310000
24329,2024-11-06,5864.890137,5936.140137,5864.890137,5929.040039,6329530000
24330,2024-11-07,5947.209961,5983.839844,5947.209961,5973.100098,4925740000
24331,2024-11-08,5976.759766,6012.450195,5976.759766,5995.540039,4666740000
24332,2024-11-11,6008.859863,6017.310059,5986.689941,6001.350098,4333000000

In [4]:
SP_500.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 24333 entries, 0 to 24332
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    24333 non-null  object
 1   Open    24333 non-null  float64
 2   High    24333 non-null  float64
 3   Low     24333 non-null  float64
 4   Close   24333 non-null  float64
 5   Volume  24333 non-null  int64
dtypes: float64(4), int64(1), object(1)
memory usage: 1.1+ MB

In [5]:
SP_500.describe()

               Open          High           Low         Close        Volume
count  24333.000000  24333.000000  24333.000000  24333.000000  2.433300e+04
mean     631.052387    654.591272    646.790868    650.939883  9.148267e+08
std     1078.427151   1073.307918   1061.371248   1067.722258  1.624004e+09
min        0.000000      4.400000      4.400000      4.400000  0.000000e+00
25%        9.720000     24.719999     24.719999     24.719999  1.540000e+06
50%       43.220001    103.309998    101.639999    102.430000  2.064000e+07
75%     1043.630005   1050.109985   1034.150024   1043.630005  1.015300e+09
max     6008.859863   6017.310059   5986.689941   6001.350098  1.145623e+10

In [6]:
SP_500.isnull().sum()

Date      0
Open      0
High      0
Low       0
Close     0
Volume    0
dtype: int64

In [8]:
SP_500.isna().sum()

Date      0
Open      0
High      0
Low       0
Close     0
Volume    0
dtype: int64

In [9]:
SP_500.duplicated().sum()

np.int64(0)

Changing Data column type to "datetime64"

In [10]:
SP_500['Date'] = pd.to_datetime(SP_500['Date'])

In [ ]:
SP_500.info() # Changed date to datetime64 type

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 24333 entries, 0 to 24332
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    24333 non-null  datetime64[ns]
 1   Open    24333 non-null  float64
 2   High    24333 non-null  float64
 3   Low     24333 non-null  float64
 4   Close   24333 non-null  float64
 5   Volume  24333 non-null  int64
dtypes: datetime64[ns](1), float64(4), int64(1)
memory usage: 1.1 MB

Trim the data from a start date September 18 2014

In [ ]:
# Filter Data from sep 18 2014 (same has bitcoin)
start_date = "2014-09-18"
SP_500_data_filtered = SP_500[SP_500['Date'] >= start_date]

In [13]:
# Convert into a CSV
SP_500_data_filtered.to_csv('./Data_files/sp500_data_filtered.csv', index=False)

In [16]:
# Validate the filtered data
df = pd.read_csv('./Data_files/sp500_data_filtered.csv')
df

,Date,Open,High,Low,Close,Volume
0,2014-09-18,2003.069946,2012.339966,2003.069946,2011.359985,3235340000
1,2014-09-19,2012.739990,2019.260010,2006.589966,2010.400024,4880220000
2,2014-09-22,2009.079956,2009.079956,1991.010010,1994.290039,3349670000
3,2014-09-23,1992.780029,1995.410034,1982.770020,1982.770020,3279350000
4,2014-09-24,1983.339966,1999.790039,1978.630005,1998.300049,3313850000
...,...,...,...,...,...,...
2550,2024-11-05,5722.430176,5783.439941,5722.100098,5782.759766,3768310000
2551,2024-11-06,5864.890137,5936.140137,5864.890137,5929.040039,6329530000
2552,2024-11-07,5947.209961,5983.839844,5947.209961,5973.100098,4925740000
2553,2024-11-08,5976.759766,6012.450195,5976.759766,5995.540039,4666740000
2554,2024-11-11,6008.859863,6017.310059,5986.689941,6001.350098,4333000000